{"config": [{"config": {"name": "conv2d_1", "data_format": "channels_last", "dtype": "float32", "dilation_rate": [1, 1], "batch_input_shape": [null, 100, 100, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "padding": "valid", "activity_regularizer": null, "activation": "tanh", "filters": 32, "use_bias": true, "kernel_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "trainable": true}, "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_1", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "gamma_regularizer": null, "center": true, "scale": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "axis": -1, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"name": "max_pooling2d_1", "padding": "valid", "dtype": "float32", "strides": [2, 2], "pool_size": [2, 2], "batch_input_shape": [null, 100, 100, 3], "data_format": "channels_last", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"name": "conv2d_2", "data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "padding": "valid", "activity_regularizer": null, "activation": "tanh", "filters": 64, "use_bias": true, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "trainable": true}, "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_2", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "gamma_regularizer": null, "center": true, "scale": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "axis": -1, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"name": "max_pooling2d_2", "padding": "valid", "dtype": "float32", "strides": [2, 2], "pool_size": [2, 2], "batch_input_shape": [null, 100, 100, 3], "data_format": "channels_last", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.1, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"name": "conv2d_3", "data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "padding": "valid", "activity_regularizer": null, "activation": "tanh", "filters": 128, "use_bias": true, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "trainable": true}, "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_3", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "gamma_regularizer": null, "center": true, "scale": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "axis": -1, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"name": "max_pooling2d_3", "padding": "valid", "dtype": "float32", "strides": [2, 2], "pool_size": [2, 2], "batch_input_shape": [null, 100, 100, 3], "data_format": "channels_last", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_3", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"name": "conv2d_4", "data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "padding": "valid", "activity_regularizer": null, "activation": "tanh", "filters": 256, "use_bias": true, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "trainable": true}, "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_4", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "gamma_regularizer": null, "center": true, "scale": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "axis": -1, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"name": "max_pooling2d_4", "padding": "valid", "dtype": "float32", "strides": [2, 2], "pool_size": [2, 2], "batch_input_shape": [null, 100, 100, 3], "data_format": "channels_last", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_4", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "units": 8196, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "tanh", "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "dropout_5", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "units": 2, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "sigmoid", "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "dense_3", "units": 8196, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "tanh", "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "dropout_6", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"name": "dense_4", "units": 1, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "sigmoid", "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.2.1", "class_name": "Sequential"}